app/controllers/reviews_controller.rb

  def index
    @reviews = Review.where(product_id: params[:product_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]

  def create
    @review = Review.new(review_params)

    if @review.save
---
INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "author" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["author", "some gal"], ["updated_at", "2021-02-25 14:30:25.726124"], ["id", 3]]